#include <bits/stdc++.h>
using namespace std;
int main()
{
 priority_queue<int> pq;// একটি ম্যাক্সিমাম প্রায়োরিটি কিউ নেওয়া হচ্ছে। 
 while (true)
 {
 int c;
 cin >> c;// অপারেশন ইনপুট নেওয়া হচ্ছে। এক্ষেত্রে আমরা ধরে নিচ্ছি ০ হচ্ছে পুশ, ১ হচ্ছে পপ আর ২ হচ্ছে টপ প্রিন্ট করা।
 if (c == 0)
 {
 int x;
 cin >> x; // সংখ্যা ইনপুট নিয়ে
 pq.push(x);// প্রায়োরিটি কিউতে পুশ করা হচ্ছে। যার কমপ্লেক্সিটি O(logN)
 }
else if (c == 1)
 {
 pq.pop();// পপ করা হচ্ছে যার কমপ্লেক্সিটি O(logN)। এক্ষেত্রে পপ করলে টপের ভেলু অর্থাৎ সবচেয়ে বড় ভেলুটি পপ হবে।
 }
else if (c == 2)
 {
 cout << pq.top() << endl; // টপের ভেলু অর্থাৎ সবচেয়ে বড় ভেলুটি [যেহেতু এটি ম্যাক্সিমাম প্রায়োরিটি কিউ ] প্রিন্ট হবে। যার কমপ্লেক্সিটি O(1)
 }
 else
{
break;
 }
}
 return 0;
} 
